import re
from dataclasses import dataclass
from typing import Callable

from mwparserfromhell.wikicode import Wikicode

NS_MAIN = 0
NS_USER = 2
NS_USER_TALK = 3
NS_TEMPLATE = 10
NS_TEMPLATE_TALK = 11
NS_LEXEME = 146

RUSSIAN_LANGUAGE = 'Q7737'

HTML_BR_TAGS = {'<br>', '<br >', '<br/>', '<br />'}


@dataclass
class Field:
    name: str
    alt: str = None
    required: bool = True
    parser: Callable[[Wikicode], None] = None


known_fields = [
    # именительный
    Field('Кто/что? (ед)', alt='nom-sg'), Field('nom-sg2', required=False),
    Field('Кто/что? (мн)', alt='nom-pl'), Field('nom-pl2', required=False),
    # родительный
    Field('Нет кого/чего? (ед)', alt='gen-sg'), Field('gen-sg2', required=False),
    Field('Нет кого/чего? (мн)', alt='gen-pl'), Field('gen-pl2', required=False),
    # дательный
    Field('Кому/чему? (ед)', alt='dat-sg'), Field('dat-sg2', required=False),
    Field('Кому/чему? (мн)', alt='dat-pl'), Field('dat-pl2', required=False),
    # винительный
    Field('Кого/что? (ед)', alt='acc-sg'), Field('acc-sg2', required=False),
    Field('Кого/что? (мн)', alt='acc-pl'), Field('acc-pl2', required=False),
    # творительный
    Field('Кем/чем? (ед)', alt='ins-sg'), Field('ins-sg2', required=False),
    Field('Кем/чем? (мн)', alt='ins-pl'), Field('ins-pl2', required=False),
    # предложный
    Field('О ком/чём? (ед)', alt='prp-sg'), Field('prp-sg2', required=False),
    Field('О ком/чём? (мн)', alt='prp-pl'), Field('prp-pl2', required=False),

    Field('loc-sg', required=False),  # словоформа местного падежа
    Field('voc-sg', required=False),  # словоформа звательного падежа
    Field('prt-sg', required=False),  # словоформа разделительного падежа
    Field('Сч', required=False),  # счётная форма
    Field('П', required=False),  # словоформа притяжательного падежа
    Field('Пр', required=False),  # словоформа превратительного падежа

    Field('скл', required=False),
    Field('слоги', required=False),
    Field('кат', required=False),
    Field('зализняк', required=False),
    Field('род', required=False),
    Field('pt', required=False),
    Field('st', required=False),
]

remove_on_st = ['acc-pl', 'dat-pl', 'gen-pl', 'ins-pl', 'nom-pl', 'prp-pl',
                'acc-pl2', 'dat-pl2', 'gen-pl2', 'ins-pl2', 'nom-pl2', 'prp-pl2']

remove_on_pt = ['acc-sg', 'dat-sg', 'gen-sg', 'ins-sg', 'nom-sg', 'prp-sg',
                'acc-sg2', 'dat-sg2', 'gen-sg2', 'ins-sg2', 'nom-sg2', 'prp-sg2']

is_required_fld = {f.alt or f.name: f.required for f in known_fields}

# skip_templates = {'сущ ru m a', 'сущ ru f a', 'сущ ru n a', 'сущ ru m ina', 'сущ ru f ina', 'сущ ru n ina',
#                   'сущ ru', 'сущ-ru'}

re_template_names = re.compile(
    r'^(([tT]emplate|[шШ]аблон):)?' +
    r'('
    r'([iI]nflection )?[сС]ущ[- _]+ru([ +]?$|[ +][^/\n]*(//)?[^/\n]*$)'
    r'|сущ n '
    r'|[пП]рил ru'
    r'|гл[ _]ru([- _]\w+)*'
    r'|[гГ]л-блок2наст'
    r'|Мс-'
    r'|[тТ]аблица склонения ru .*'
    r'|[Фф]ам([- _]\w+)+'
    r'|прич[ _]ru([- _]\w+)*'
    r'|мест[ _]ru'
    r'|числ[ _]ru([- _]\w+)*'
    r'|числ-'
    r'|[кК]ол[ _]чис '
    r')')

re_russian_word_suspect = re.compile(
    r'[аАбБвВгГдДеЕёЁжЖзЗѕЅиИіІйЙкКлЛмМнНѣоОпПрРсСтТуУфФхХцЦчЧшШщЩъЪыЫьЬэЭюЮяЯѡѠѢѧѦѩѨѫѪѭѬѯѮѱѰѳѲѵѴ]')


# re_extra_templates = r'^([tT]emplate|[шШ]аблон):(' + '|'.join(['падежи', 'кавычки']) + ')$'


def title_case_re(title):
    if title[0].isalpha():
        return f'[{title[0].upper()}|{title[0].lower()}]{title[1:]}'
    return title


def double_title_case(dataset: set):
    for title in list(dataset):
        if title[0].isalpha():
            if title[0].islower():
                dataset.add(title[0].upper() + title[1:])
            else:
                dataset.add(title[0].lower() + title[1:])


root_templates = {
    '-ся', '=', 'abbrev', 'adv ru', 'alt', 'anim', 'cf', 'conj ru', 'inflection сущ ru', 'interj ru', 'morph',
    'part ru', 'phrase', 'prep ru', 'suffix ru', 'transcription-ru', 'transcriptions-ru', 'астроним', 'гидроним',
    'деепр ru', 'дееприч.', 'действие', 'илл', 'медиа', 'морфема', 'морфо', 'морфо-ru', 'наречие', 'не путать',
    'омонимы', 'омофоны', 'омоформы', 'орфоэпия', 'падежи', 'превосх.', 'прич.', 'свойство', 'собств.', 'сокращ',
    'сравн.', 'страд.', 'сущ-ru', 'также', 'топоним', 'фам', 'форма-прил', 'форма-прич', 'форма-сущ', 'форма-гл',
    'числ-5', 'не так', 'interj-ru', 'onomatop ru', 'predic ru', 'актанты', 'спряжения', 'intro ru', 'init', 'неё',
    'степени сравнения', 'Форма-мест', 'совершить', 'числ ru 7-8-десят', 'гл ru', 'Гл-блок', 'См', 'числ',
    'transcription', 'множ.', 'Форма-числ', 'по-слогам', 'по слогам'
}

re_template_name_suspect = re.compile(r'^(([tT]emplate|[шШ]аблон):)?[сС]ущ[ _]')
re_root_templates = re.compile('|'.join((title_case_re(v) for v in root_templates)))
re_root_templates_full_str = re.compile(r'^' + '|'.join((title_case_re(v) for v in root_templates)) + r'$')
double_title_case(root_templates)

known_headers = ['-sla-pro-', '-ru-', '-ru-old-']
re_known_headers = re.compile('|'.join((v for v in known_headers)))
root_header_templates = {
    'з', 'заголовок',
}
ignore_templates = {
    '-', '--', '--+', '-ание', '-атель', '-ация', '-ение', '-ист', '-ка', '?', '??', '^', '3л.', 'addoncat', 'anchor',
    'aslinks', 'bagua nav', 'Brückner', 'cite web', 'clear', 'comment', 'commons', 'Cyrs', 'de', 'en', 'es', 'ESJČ',
    'etym-lang', 'f', 'f60', 'fonts', 'forms', 'fr', 'fr1', 'fr2', 'fr4', 'fr6', 'frD', 'frE', 'freq', 'frF', 'i-a',
    'improve', 'incorrect', 'it', 'Jpan', 'Karulis', 'key', 'lang', 'lang-ar', 'lang-el', 'lang-en', 'lang-es',
    'lang-grc', 'lang-he', 'lang2', 'letter disp2', 'letter_disp2', 'm', 'MAC', 'main other', 'multilang', 'n',
    'ngram ru', 'nl', 'nobr', 'OED', 'off', 'offensive', 'offensive-block', 'offensive-inline', 'Old-ru', 'Oxford',
    'pl', 'pt', 'razr', 'reflist', 'Script/Slavonic', 'sla-pro', 'stub', 'sv', 't', 'table-bot', 'table-mid',
    'table-top', 'tblV', 'term', 'tradu', 'transcriptions', 'uk', 'unfinished', 'verb-dir', 'verb-dir-n', 'wikify',
    'wikipedia', 'zh', 'аббр.', 'Аванесов1988', 'авиац.', 'авто', 'авто.жарг.', 'автомоб.', 'автомоб. жарг.', 'автор',
    'Агеенко', 'агрон.', 'Адамчик', 'адъект.', 'адъектив.', 'Академия-1', 'Академия-2', 'Академия-3', 'алхим.', 'альп.',
    'амер.', 'анат.', 'анатом.', 'Аникин', 'антроп.', 'Арапова', 'арм.', 'арм. жарг.', 'артилл.', 'арх.', 'археол.',
    'архит.', 'архитект.', 'астрол.', 'астрон.', 'аудио', 'аффиксы', 'БАС', 'безл.', 'библ.', 'библейск.', 'библио',
    'Библия', 'Библия2', 'биол.', 'биохим.', 'бирж.', 'болг.', 'бот.', 'ботан.', 'бран.', 'бранн.', 'БСКСРЯ', 'БСЭ-1',
    'БСЭ-2', 'Буй', 'букв.', 'бухг.', 'Быть', 'в три колонки', 'варианты', 'вводн.', 'вет.', 'википед.', 'Википедия',
    'вин.', 'Виноградов', 'воен.', 'воен. жарг.', 'военн.', 'военн. жарг.', 'возвр.', 'врезка', 'вставить переводы',
    'ВТ-Даль', 'втч', 'вульг.', 'выдел', 'высок.', 'Ганжина', 'гастрон.', 'ген.', 'генет.', 'геогр.', 'геод.', 'геол.',
    'геом.', 'геометр.', 'геометрические фигуры', 'геофиз.', 'геральд.', 'гидрол.', 'гидротехн.', 'гипокор.', 'горн.',
    'грам.', 'Графика', 'Грачёв', 'греческая буква', 'гру', 'груб.', 'Даль', 'Даль-3', 'дат', 'деепр.', 'детск.',
    'диал.', 'дипл.', 'дисфм.', 'длина слова', 'Дядечко', 'ед.', 'ед. ч.', 'Елистратов', 'Епишкин', 'ЕСУМ5', 'Ефремова',
    'ж.', 'ж.-д.', 'жарг.', 'жарг. гом.', 'жарг. ЛГБТ', 'жарг. нарк.', 'жаргон википроектов', 'жаргон ФВМ', 'ЖД', 'жд',
    'женск.', 'Живая речь', 'живоп.', 'животн.', 'Жуков, 1991', 'журн.', 'Зайцева 2013', 'Зарва2001', 'звукоподр',
    'Знаки Зодиака', 'значение', 'значение?', 'зоол.', 'И-МАС', 'И-Рез', 'И-СТСЕ', 'игр.', 'из', 'иноск.', 'интервалы',
    'интернет.', 'информ.', 'ирон.', 'иск.', 'искаж.', 'искусств.', 'ист.', 'истор.', 'История Японии', 'Источники',
    'исч.', 'итд', 'итп', 'ихтиол.', 'йогич.', 'кавычки', 'канц.', 'карт.', 'категория', 'Категория', 'КЕ', 'керам.',
    'кино', 'кинол.', 'книга', 'Книга:Апрес95', 'Книга:Квеселевич', 'Книга:Ключевые идеи', 'Книга:Мельчук', 'книжн.',
    'кол', 'комп.', 'комп. жарг.', 'комп.жарг.', 'конев.', 'конец кол', 'Коровушкин', 'косм.', 'космет.', 'крим.',
    'крим.    жарг.', 'крим. жарг.', 'Крылов', 'кс', 'КСИЯ-2', 'кубан.', 'Кузнецова и Ефремова', 'кулин.', 'культурол.',
    'ласк.', 'Лебедева', 'лес.', 'лики святости ru', 'лингв.', 'лит.', 'литер.', 'лог.', 'м.', 'марр', 'МАС', 'МАС2',
    'мат', 'матем.', 'машин.', 'мед.', 'Мельчук', 'местн.', 'месяцы', 'месяцы FR', 'метаграммы:*ело', 'металл.',
    'метео', 'метеор.', 'метеорол.', 'метоним.', 'мех.', 'микол.', 'микробиол.', 'милиц. жарг.', 'мин.', 'минер.',
    'минерал.', 'мир, смирный', 'миф.', 'мифол.', 'мкб.', 'мн', 'мн.', 'мн. ч.', 'мн.ч.', 'многокр.', 'Мокиенко',
    'Мокиенко, Никитина 2007', 'мол.', 'мор.', 'морск.', 'муз.', 'муз. жарг.', 'музы', 'мфа?', 'Навигация', 'наказания',
    'нар.-поэт.', 'нар.-разг.', 'нареч.', 'нарк.', 'насл', 'научн.', 'неделя', 'неисч.', 'неодобр.', 'неодуш.', 'неол.',
    'неофиц.', 'неперех.', 'неправ.', 'нескл.', 'несов.', 'нет примеров', 'неуп.', 'неуст', 'нефт.', 'нефтегаз.',
    'Никитина', 'Никонов', 'НОСС', 'ноты', 'НСЗ-60', 'НСЗ-70', 'НСЗ-80', 'НСЗ-90', 'Нужен перевод', 'нумизм.', 'обл.',
    'образ.', 'обсц.', 'однокр.', 'одобр.', 'одуш.', 'Ожегов-28', 'оккульт.', 'опт.', 'орнит.', 'орнитол.', 'оскорбит.',
    'ОСРЯ', 'от', 'отн.', 'отсылка', 'отчество', 'офиц.', 'охотн.', 'ОЭСРЯ-10', 'п.', 'пал.', 'палеонт.', 'палеонтол.',
    'парикмах.', 'перев-блок', 'переводы', 'перен.', 'перех.', 'плотн.', 'Плуцер', 'по', 'полигр.', 'полит.',
    'полит. жарг.', 'полит.жарг.', 'полиц. жарг.', 'помета', 'помета.', 'порт.', 'портн.', 'Поспелов-ГНМ',
    'Поспелов-ГНР', 'поэт.', 'прагерм', 'праиндоевр', 'праслав', 'предик.', 'прежде', 'презр.', 'презрит.', 'пренебр.',
    'пример', 'примечания', 'приставки СИ', 'прогр.', 'произв', 'прост.', 'прото', 'проф.', 'прочее-блок', 'психиатр.',
    'психол.', 'публ.', 'публиц.', 'пчел.', 'радио', 'радиоэл.', 'разг.', 'рег.', 'редк.', 'результат', 'рекл.', 'рел.',
    'религ.', 'РЖ', 'ритор.', 'РОС-4', 'Россия', 'Рус.грамматика-80', 'русские падежи', 'русские приставки',
    'Русский алфавит', 'рыбол.', 'РЭС', 'С:orv:Срезневский', 'С:ru:Фасмер', 'С:ru:Черных', 'С:ru:Шанский', 'с.-х.',
    'сад.', 'Сазонова', 'СГНЗС', 'сексол.', 'сельск.', 'сельхоз.', 'семантика', 'Серов', 'синонимы', 'синонимы:мало',
    'синонимы:много', 'Скляревская 2006', 'скр1', 'скр2', 'скрыто', 'Слайдер', 'сленг', 'сленг.', 'СЛИН', 'слобр',
    'слово дня', 'словоформа', 'слря11-17', 'слря18', 'слэнг', 'см-70', 'см-77', 'см-82', 'см-83', 'смягчит.', 'сниж.',
    'СНС 50-80', 'СНСРЯ', 'собир.', 'собират.', 'сов.', 'Совдепия', 'совет.', 'советск.', 'сокр.', 'Солженицын',
    'соотн.', 'СОРЯА', 'состояние', 'социол.', 'спелеол.', 'спец.', 'списки семантических связей', 'спорт.', 'ср.',
    'СРНГ-2', 'СРРЭ', 'СРФ', 'СРЯ 11-17', 'СРЯ 18', 'ССРЛЯ', 'ссылки', 'ссылки с пометой', 'старин.', 'стат.',
    'статив.', 'статья', 'стекловарн.', 'стол.', 'столярн.', 'СТРА', 'строит.', 'студ.', 'студ. жарг.', 'студ.жарг.',
    'субст.', 'субстантив.', 'субстантивир.', 'Суперанская-СГН', 'сх', 'сэ', 'табу', 'театр.', 'текст.', 'телеком.',
    'Телия', 'термин', 'тех.', 'техн.', 'техн. жарг.', 'техн.жарг.', 'тж.', 'типогр.', 'Тихонов', 'Толль', 'торг.',
    'торж.', 'трад.-нар.', 'трад.-поэт.', 'тракторн.', 'транс.', 'трансп.', 'тс', 'ТСД', 'ТСРРР', 'ТСРРЯ', 'ТСРЯЭ',
    'ТССЕРЯ', 'уважит.', 'увелич.', 'увеличит.', 'уг. жарг.', 'угол.', 'укр.', 'ум.-ласк.', 'уменьш.', 'умласк',
    'умласк.', 'Унбегаун', 'унич.', 'уничиж.', 'управл.', 'усилит.', 'уст.', 'устар.',
    'Участник:Vitalik7/Песочница/проверка включения длины слова', 'Ушаков', 'Ушаков1940', 'Ф', 'фам.', 'фант.', 'фарм.',
    'Фасмер', 'физ.', 'физиол.', 'филат.', 'филол.', 'филос.', 'фин.', 'фобия', 'фолькл.', 'фото', 'фотогр.',
    'Фразеологизмы', 'Фразеологический словарь Молоткова, 1987', 'ФСРЛЯ', 'хим-элем', 'хим.', 'хоз.', 'худ.пр.',
    'худож.', 'ц.-слав.', 'цвет', 'ценз', 'ценз2', 'церк.', 'церк.-сл.', 'церк.-слав.', 'цирк.', 'цитол.', 'цы',
    'Цыганенко', 'через', 'через2', 'Черных', 'Шагалова', 'Шагалова 2017', 'Шанский', 'Шапошников', 'шахм.',
    'Шахматная диаграмма', 'шашечн.', 'швейн.', 'Шипова', 'школьн.', 'шутл.', 'э:cu:градъ', 'э:orv:громъ',
    'э:orv:сахаръ', 'эвф.', 'экзот.', 'экол.', 'экон.', 'эконом.', 'экспр.', 'экспресс.', 'эл.-техн.', 'эл.-энерг.',
    'электр.', 'энтом.', 'энтомол.', 'эррат.', 'ЭСБЕ', 'ЭСРЯ МГУ', 'ЭССЯ2', 'этимология', 'этимология:',
    'этимология:варроатоз', 'этимология:вода', 'этимология:Ярило', 'этногр.', 'этнол.', 'этнолог.', 'ювел.', 'юр.',
    'юрид.', 'ЯИ', 'ЯН', 'ЯРГ', 'Периодическая система элементов', 'Cquote', 'fr0', 'Без употребления', 'БТС', 'ГСРЯ',
    'Еськова', 'картеж.жарг.', 'Квеселевич', 'прил-сравн ru', 'прил0', 'СРНГ', 'ТЛБ', 'хореогр.', 'Шагалова2012',
    'стомат.', 'ся'}
double_title_case(ignore_templates)

re_ignore_template_prefixes = re.compile(
    r'^(DEFAULTSORT:|[эЭ]тимология:|[рР]одств:|[гГ]ипонимы:|[сС]инонимы:|#lst:|formatnum:|[мМ]ета:|[кК]нига:|[мМ]етаграммы:|родств-)')
