import re

import unicodedata

RUSSIAN_PRE_REFORM_ID = 'ru-x-Q2442696'
STRESS_SYMBOL_PRI = '\u0301'
STRESS_SYMBOL_SEC = '\u0300'

RUSSIAN_ALPHABET = 'аАбБвВгГдДеЕёЁжЖзЗиИйЙкКлЛмМнНоОпПрРсСтТуУфФхХцЦчЧшШщЩъЪыЫьЬэЭюЮяЯ'
RUSSIAN_ALPHABET_EXT = 'ѕЅіІѣѡѠѢѧѦѩѨѫѪѭѬѯѮѱѰѳѲѵѴ'

RUSSIAN_STRESSABLE_LETTERS = 'аАеЕиИоОуУэЭюЮяЯ'
RUSSIAN_ALPHABET_STRESS = \
    RUSSIAN_ALPHABET + STRESS_SYMBOL_PRI + STRESS_SYMBOL_SEC + unicodedata.normalize(
        'NFC',
        ''.join(((v + STRESS_SYMBOL_PRI + v + STRESS_SYMBOL_SEC) for v in RUSSIAN_STRESSABLE_LETTERS)))


def remove_stress(word: str) -> str:
    return unicodedata.normalize(
        'NFC', unicodedata.normalize('NFD', word).replace(STRESS_SYMBOL_PRI, '').replace(STRESS_SYMBOL_SEC, ''))


# noinspection SpellCheckingInspection
ru_ignore_templates = {
    '-', '--', '--+', '-ание', '-атель', '-ация', '-ение', '-ист', '-ка', '3л.', '?', '??', '^', 'addoncat',
    'anchor', 'aslinks', 'bagua nav', 'brückner', 'cite web', 'clear', 'comment', 'commons', 'cquote', 'cyrs', 'de',
    'en', 'es', 'eSJČ', 'etym-lang', 'f', 'f60', 'fonts', 'forms', 'fr', 'fr0', 'fr1', 'fr2', 'fr4', 'fr6', 'frD',
    'frE', 'freq', 'frF', 'i-a', 'improve', 'incorrect', 'inflection сущ ru/text', 'it', 'jpan', 'karulis', 'key',
    'lang', 'lang-ar', 'lang-el', 'lang-en', 'lang-es', 'lang-grc', 'lang-he', 'lang2', 'letter disp2',
    'letter_disp2', 'm', 'mAC', 'main other', 'multilang', 'n', 'ngram ru', 'nl', 'nobr', 'oED', 'off', 'offensive',
    'offensive-block', 'offensive-inline', 'old-ru', 'oxford', 'pl', 'pt', 'razr', 'reflist', 'script/Slavonic',
    'sla-pro', 'stub', 'sv', 't', 'table-bot', 'table-mid', 'table-top', 'tblV', 'term', 'tradu', 'transcriptions',
    'uk', 'unfinished', 'verb-dir', 'verb-dir-n', 'wikify', 'wikipedia', 'zh', 'аббр.', 'аванесов1988', 'авиац.',
    'авто', 'авто.жарг.', 'автомоб. жарг.', 'автомоб.', 'автор', 'агеенко', 'агрон.', 'адамчик', 'адъект.',
    'адъектив.', 'академия-1', 'академия-2', 'академия-3', 'алхим.', 'альп.', 'амер.', 'анат.', 'анатом.', 'аникин',
    'антроп.', 'арапова', 'арм. жарг.', 'арм.', 'артилл.', 'арх.', 'археол.', 'архит.', 'архитект.', 'астрол.',
    'астрон.', 'аудио', 'аффиксы', 'бАС', 'без употребления', 'безл.', 'библ.', 'библейск.', 'библио', 'библия',
    'библия2', 'биол.', 'биохим.', 'бирж.', 'болг.', 'бот.', 'ботан.', 'бран.', 'бранн.', 'бСКСРЯ', 'бСЭ-1',
    'бСЭ-2', 'бТС', 'буй', 'букв.', 'бухг.', 'быть', 'в три колонки', 'варианты', 'вводн.', 'вет.', 'википед.',
    'википедия', 'вин.', 'виноградов', 'воен. жарг.', 'воен.', 'военн. жарг.', 'военн.', 'возвр.', 'врезка',
    'вставить переводы', 'вТ-Даль', 'втч', 'вульг.', 'выдел', 'высок.', 'ганжина', 'гастрон.', 'ген.', 'генет.',
    'геогр.', 'геод.', 'геол.', 'геом.', 'геометр.', 'геометрические фигуры', 'геофиз.', 'геральд.', 'гидрол.',
    'гидротехн.', 'гипокор.', 'горн.', 'грам.', 'графика', 'грачёв', 'греческая буква', 'гру', 'груб.', 'гСРЯ',
    'даль', 'даль-3', 'дат', 'деепр.', 'детск.', 'диал.', 'дипл.', 'дисфм.', 'длина слова', 'дядечко', 'ед. ч.',
    'ед.', 'елистратов', 'епишкин', 'еСУМ5', 'еськова', 'ефремова', 'ж.', 'ж.-д.', 'жарг. гом.', 'жарг. ЛГБТ',
    'жарг. нарк.', 'жарг.', 'жаргон википроектов', 'жаргон ФВМ', 'жД', 'жд', 'женск.', 'живая речь', 'живоп.',
    'животн.', 'жуков, 1991', 'журн.', 'зайцева 2013', 'зарва2001', 'звукоподр', 'знаки Зодиака', 'значение',
    'значение?', 'зоол.', 'и-МАС', 'и-Рез', 'и-СТСЕ', 'игр.', 'из', 'илл-знак', 'иноск.', 'интервалы', 'интернет.',
    'информ.', 'ирон.', 'иск.', 'искаж.', 'искусств.', 'ист.', 'истор.', 'история Японии', 'источники', 'исч.',
    'итд', 'итп', 'ихтиол.', 'йогич.', 'кавычки', 'канц.', 'карт.', 'картеж.жарг.', 'категория', 'категория',
    'квеселевич', 'кЕ', 'керам.', 'кино', 'кинол.', 'книга', 'книга:Апрес95', 'книга:Квеселевич',
    'книга:Ключевые идеи', 'книга:Мельчук', 'книжн.', 'кол', 'комп. жарг.', 'комп.', 'комп.жарг.', 'конев.',
    'конец кол', 'коровушкин', 'косм.', 'космет.', 'крим.    жарг.', 'крим. жарг.', 'крим.', 'крылов', 'кс',
    'кСИЯ-2', 'кубан.', 'кузнецова и Ефремова', 'кулин.', 'культурол.', 'ласк.', 'лебедева', 'лес.',
    'лики святости ru', 'лингв.', 'лит.', 'литер.', 'лог.', 'м.', 'марр', 'мАС', 'мАС2', 'мат', 'матем.', 'машин.',
    'мед.', 'мельчук', 'местн.', 'месяцы FR', 'месяцы', 'метаграммы:*ело', 'металл.', 'метео', 'метеор.',
    'метеорол.', 'метоним.', 'мех.', 'микол.', 'микробиол.', 'милиц. жарг.', 'мин.', 'минер.', 'минерал.',
    'мир, смирный', 'миф.', 'мифол.', 'мкб.', 'мн', 'мн. ч.', 'мн.', 'мн.ч.', 'многокр.', 'мокиенко',
    'мокиенко, Никитина 2007', 'мол.', 'мор.', 'морск.', 'муз. жарг.', 'муз.', 'музы', 'мфа?', 'навигация',
    'наказания', 'нар.-поэт.', 'нар.-разг.', 'нареч.', 'нарк.', 'насл', 'научн.', 'неделя', 'неисч.', 'неодобр.',
    'неодуш.', 'неол.', 'неофиц.', 'неперех.', 'неправ.', 'нескл.', 'несов.', 'нет примеров', 'неуп.', 'неуст',
    'нефт.', 'нефтегаз.', 'никитина', 'никонов', 'нОСС', 'ноты', 'нСЗ-60', 'нСЗ-70', 'нСЗ-80', 'нСЗ-90',
    'нужен перевод', 'нумизм.', 'обл.', 'образ.', 'обсц.', 'однокр.', 'одобр.', 'одуш.', 'ожегов-28', 'оккульт.',
    'опт.', 'орнит.', 'орнитол.', 'оскорбит.', 'оСРЯ', 'от', 'отн.', 'отсылка', 'отчество', 'офиц.', 'охотн.',
    'оЭСРЯ-10', 'п.', 'пал.', 'палеонт.', 'палеонтол.', 'парикмах.', 'перев-блок', 'переводы', 'перен.', 'перех.',
    'периодическая система элементов', 'плотн.', 'плуцер', 'по', 'полигр.', 'полит. жарг.', 'полит.', 'полит.жарг.',
    'полиц. жарг.', 'помета', 'помета.', 'порт.', 'портн.', 'поспелов-ГНМ', 'поспелов-ГНР', 'поэт.', 'прагерм',
    'праиндоевр', 'праслав', 'предик.', 'прежде', 'презр.', 'презрит.', 'пренебр.', 'прил-сравн ru', 'прил0',
    'пример', 'примечания', 'приставки СИ', 'причастие', 'прогр.', 'произв', 'прост.', 'прото', 'проф.',
    'прочее-блок', 'психиатр.', 'психол.', 'публ.', 'публиц.', 'пчел.', 'радио', 'радиоэл.', 'разг.', 'рег.',
    'редк.', 'результат', 'рекл.', 'рел.', 'религ.', 'рЖ', 'ритор.', 'рОС-4', 'россия', 'рус.грамматика-80',
    'русские падежи', 'русские приставки', 'русский алфавит', 'рыбол.', 'рЭС', 'с.-х.', 'с:orv:Срезневский',
    'с:ru:Фасмер', 'с:ru:Черных', 'с:ru:Шанский', 'сад.', 'сазонова', 'сГНЗС', 'сексол.', 'сельск.', 'сельхоз.',
    'семантика', 'серов', 'синонимы', 'синонимы:мало', 'синонимы:много', 'скляревская 2006', 'скр1', 'скр2',
    'скрыто', 'слайдер', 'сленг', 'сленг.', 'сЛИН', 'слобр', 'слово дня', 'словоформа', 'слря11-17', 'слря18',
    'слэнг', 'см-70', 'см-77', 'см-82', 'см-83', 'смягчит.', 'сниж.', 'сНС 50-80', 'сНСРЯ', 'собир.', 'собират.',
    'сов.', 'совдепия', 'совет.', 'советск.', 'сокр.', 'солженицын', 'соотн.', 'сОРЯА', 'состояние', 'социол.',
    'спелеол.', 'спец.', 'списки семантических связей', 'спорт.', 'ср.', 'сРНГ', 'сРНГ-2', 'сРРЭ', 'сРФ',
    'сРЯ 11-17', 'сРЯ 18', 'сСРЛЯ', 'ссылки с пометой', 'ссылки', 'старин.', 'стат.', 'статив.', 'статья',
    'стекловарн.', 'стол.', 'столярн.', 'стомат.', 'сТРА', 'строит.', 'студ. жарг.', 'студ.', 'студ.жарг.',
    'субст.', 'субстантив.', 'субстантивир.', 'суперанская-СГН', 'сх', 'сэ', 'ся', 'табу', 'театр.', 'текст.',
    'телеком.', 'телия', 'термин', 'тех.', 'техн. жарг.', 'техн.', 'техн.жарг.', 'тж.', 'типогр.', 'тихонов', 'тЛБ',
    'толль', 'торг.', 'торж.', 'трад.-нар.', 'трад.-поэт.', 'тракторн.', 'транс.', 'трансп.', 'тс', 'тСД', 'тСРРР',
    'тСРРЯ', 'тСРЯЭ', 'тССЕРЯ', 'уважит.', 'увелич.', 'увеличит.', 'уг. жарг.', 'угол.', 'укр.', 'ум.-ласк.',
    'уменьш.', 'умласк', 'умласк.', 'унбегаун', 'унич.', 'уничиж.', 'управл.', 'усилит.', 'уст.', 'устар.',
    'участник:Vitalik7/Песочница/проверка включения длины слова', 'ушаков', 'ушаков1940', 'ф', 'фам.', 'фант.',
    'фарм.', 'фасмер', 'физ.', 'физиол.', 'филат.', 'филол.', 'филос.', 'фин.', 'фобия', 'фолькл.', 'фото',
    'фотогр.', 'фразеологизмы', 'фразеологический словарь Молоткова, 1987', 'фСРЛЯ', 'хим-элем', 'хим.', 'хоз.',
    'хореогр.', 'худ.пр.', 'худож.', 'ц.-слав.', 'цвет', 'ценз', 'ценз2', 'церк.', 'церк.-сл.', 'церк.-слав.',
    'цирк.', 'цитол.', 'цы', 'цыганенко', 'через', 'через2', 'черных', 'числ.', 'шагалова 2017', 'шагалова',
    'шагалова2012', 'шанский', 'шапошников', 'шахм.', 'шахматная диаграмма', 'шашечн.', 'швейн.', 'шипова',
    'школьн.', 'шутл.', 'э:cu:градъ', 'э:orv:громъ', 'э:orv:сахаръ', 'эвф.', 'экзот.', 'экол.', 'экон.', 'эконом.',
    'экспр.', 'экспресс.', 'эл.-техн.', 'эл.-энерг.', 'электр.', 'энтом.', 'энтомол.', 'эррат.', 'эСБЕ', 'эСРЯ МГУ',
    'эССЯ2', 'этимология', 'этимология:', 'этимология:варроатоз', 'этимология:вода', 'этимология:Ярило', 'этногр.',
    'этнол.', 'этнолог.', 'ювел.', 'юр.', 'юрид.', 'яИ', 'яН', 'яРГ', 'форма-мест', 'форма-гл', 'форма-прил',
    'форма-сущ', 'форма-числ', 'форма-прич', 'эзот.', 'тех.жарг.', 'дееприч.', 'прич.', 'фам Козёл', 'фам 0',
    'суту́гина', 'фам рь', 'этим-2', 'акцент.', 'Елистратов, 2000', 'ар­хео­л.'
}

# noinspection SpellCheckingInspection
ru_root_templates = {
    'abbrev': 'abbreviation',
    'прил': {'adjective', 'participle'},  # прилагательное, причастие
    'прил-ru': {'adjective'},
    'прич ru': {'participle'},
    'наречие': 'adverb',
    'adv ru': 'adverb',  # наречие
    'conj ru': 'conjunction',  # союз
    'interj ru': 'interjection',  # междометие
    'interj-ru': 'interjection',  # междометие
    'inflection сущ ru': 'noun',
    'сущ ru': 'noun',
    'сущ-ru': 'noun',
    'топоним': 'noun',
    'фам': 'noun',
    'фам-блок': 'noun',
    'гидроним': 'noun',
    'числ': 'number',
    'числ ru 7-8-десят': 'number',
    'числ-5': 'number',
    'onomatop ru': 'onomatopoeia',
    'part ru': 'particle',  # частица
    'predic ru': 'predicate',  # сказуемое
    'prep ru': 'preposition',  # предлог
    'suffix ru': 'suffix',
    'гл ru': 'verb',
    'гл-блок': 'verb',
    'спряжения': 'verb',
    'деепр ru': 'transgressive',  # деепричастие

    '-ся': 0, '=': 0, 'alt': 0, 'anim': 0, 'cf': 0, 'morph': 0, 'phrase': 0, 'transcription-ru': 0,
    'transcriptions-ru': 0, 'астроним': 0, 'действие': 0, 'илл': 0, 'медиа': 0, 'морфема': 0, 'морфо': 0,
    'морфо-ru': 0, 'не путать': 0, 'омонимы': 0, 'омофоны': 0, 'омоформы': 0, 'омоформы02': 0, 'орфоэпия': 0,
    'падежи': 0, 'превосх.': 0, 'свойство': 0, 'собств.': 0, 'сокращ': 0, 'сравн.': 0, 'страд.': 0,
    'также': 0, 'не так': 0, 'актанты': 0, 'intro ru': 0, 'init': 0, 'неё': 0, 'степени сравнения': 0,
    'совершить': 0, 'см': 0, 'transcription': 0, 'множ.': 0, 'по-слогам': 0, 'по слогам': 0,
    'падежи ru 1': 0, 'падежи ru m n f pl': 0, 'слоги': 0, 'слог': 0, 'лексема в Викиданных': 0,
}

# noinspection SpellCheckingInspection
ru_re_template_names = re.compile(
    r'^(([tT]emplate|[шШ]аблон):)?' + r'('
                                      r'([iI]nflection )?[сС]ущ[- _]+ru([ +]?$|[ +][^/\n]*(//)?[^/\n]*$)'
                                      r'|сущ n '
                                      r'|[пП]рил ru'
                                      r'|гл[ _]ru[ _]'
                                      r'|[гГ]л-блок2наст'
                                      r'|Мс-'
                                      r'|[тТ]аблица склонения ru .*'
                                      r'|[Фф]ам([- _]\w+)+'
                                      r'|прил[ _]ru'
                                      r'|прич[ _]ru([- _]\w+)*'
                                      r'|мест[ _]ru'
                                      r'|числ[ _]ru([- _]\w+)*'
                                      r'|числ-'
                                      r'|[кК]ол[ _]чис '
                                      r')'
)

Q_ZAL_ADJ_CLASSES = {
    "(мс 6*a)": "Q67537172",
    "0": "Q67537176",
    "1*a": "Q66821141",
    "1*a'": "Q67537179",
    "1*a'-": "Q67537183",
    "1*a'②": "Q67537185",
    "1*a(①)": "Q67537186",
    "1*a-": "Q67537189",
    "1*a/b": "Q67537193",
    "1*a/b~": "Q67537194",
    "1*a/b②": "Q67537198",
    "1*a/c": "Q67537201",
    "1*a/c'": "Q67537204",
    "1*a/c'~": "Q67537208",
    "1*a/c\"": "Q67537444",
    "1*aX": "Q67537210",
    "1*a~": "Q67537212",
    "1*a①": "Q67537214",
    "1*a①-": "Q67537216",
    "1*a②": "Q67537218",
    "1*b": "Q67537221",
    "1*b/c'": "Q67537223",
    "1*b/c\"": "Q67537447",
    "1*b^": "Q67537224",
    "1a": "Q67397478",
    "1a'": "Q67537229",
    "1a'~": "Q67537232",
    "1a-": "Q67537233",
    "1a/b": "Q67537237",
    "1a/c": "Q67537239",
    "1a/c'": "Q67537241",
    "1a/c'~": "Q67537244",
    "1a/c-ё": "Q67537246",
    "1a/c\"": "Q67537450",
    "1a/c~": "Q67537248",
    "1a?": "Q67537250",
    "1a?10": "Q67537253",
    "1a?7": "Q67537254",
    "1a^": "Q67537255",
    "1b": "Q67537259",
    "1b/c": "Q67537261",
    "1b/c'": "Q67537264",
    "1b/c'~": "Q67537268",
    "1b/c~": "Q67537270",
    "1b/c~^": "Q67537271",
    "1b?": "Q67537275",
    "1bX": "Q67537278",
    "2*a": "Q67537279",
    "2*a-": "Q67537281",
    "2*a^": "Q67537284",
    "2a": "Q67537286",
    "2a/c": "Q67537288",
    "3*a": "Q67537289",
    "3*a'": "Q67537293",
    "3*a/b": "Q67537295",
    "3*a/c": "Q67537299",
    "3*a/c'": "Q67537300",
    "3*a/c'^-к": "Q67537302",
    "3*a/c\"": "Q67537453",
    "3*a/c^": "Q67537304",
    "3*aX~": "Q67537307",
    "3*a~": "Q67537309",
    "3a": "Q67537311",
    "3a'": "Q67537314",
    "3a'~": "Q67537317",
    "3a/b~": "Q67537319",
    "3a/c": "Q67537321",
    "3a/c'": "Q67537327",
    "3a/c\"": "Q67537456",
    "3a/c\"~": "Q67537324",
    "3a^": "Q67537330",
    "3a^+": "Q67537332",
    "3aX~": "Q67537334",
    "3a~": "Q67537338",
    "3b": "Q67537342",
    "3b-нибудь": "Q67537344",
    "3b/c": "Q67537347",
    "3b/c'": "Q67537350",
    "3b/c'~": "Q67537353",
    "3b/c~": "Q67537356",
    "3bX~": "Q67537359",
    "4a": "Q67537362",
    "4a-ся": "Q67537364",
    "4a/b": "Q67537369",
    "4a/b'": "Q67537371",
    "4a/b~": "Q67537373",
    "4a/c": "Q67537376",
    "4aX": "Q67537378",
    "4aX~": "Q67537381",
    "4b": "Q67537382",
    "4bX": "Q67537384",
    "4b~^": "Q67537386",
    "5a": "Q67537389",
    "6a": "Q67537392",
}

Q_ZAL_NOUN_CLASSES = {
    '0': 'Q66712697',
    '1*a': 'Q66716618',
    '1a': 'Q66311515',
    '1b': 'Q66606159',
    '1c': 'Q66606177',
    '1c①': 'Q66716619',
    '1d': 'Q66606179',
    '1e': 'Q66606180',
    '1f': 'Q66606181',
    '1°a': 'Q66716620',
    '2*a': 'Q66716622',
    '2a': 'Q66606182',
    '2b': 'Q66606183',
    '2c': 'Q66606184',
    '2d': 'Q66606185',
    '2e': 'Q66606186',
    '2f': 'Q66606187',
    '3*a': 'Q66716624',
    '3*b': 'Q66716625',
    '3a': 'Q66606188',
    '3b': 'Q66606189',
    '3c': 'Q66606190',
    '3d': 'Q66606191',
    '3e': 'Q66606192',
    '3°a': 'Q66716627',
    '4a': 'Q66606193',
    '4b': 'Q66606194',
    '4c': 'Q66606195',
    '5*a': 'Q66716628',
    '5*b': 'Q66716629',
    '5a': 'Q66606196',
    '5b': 'Q66606197',
    '6*a': 'Q66716630',
    '6*b': 'Q66716631',
    '6a': 'Q66606198',
    '6b': 'Q66606199',
    '6c': 'Q66606200',
    '7a': 'Q66327520',
    '8a': 'Q66606201',
    '8b': 'Q66606202',
    '8e': 'Q66606203',
}

# '*' :'Q66624434',
# '°' :'Q66619529',
# '(1)' :'Q66624528', # ①
# '(2)' :'Q66624537', # ②
# '(3)' :'Q66624544', # ③
# '—' :'Q66624618',

# Noun Stem Classes
# 0	Q66691574
# 1	Q66605819
# 2	Q66311616
# 3	Q66312026
# 4	Q66312029
# 5	Q66312036
# 6	Q66312041
# 7	Q66312044
# 8	Q66312049

# Stress Classes
# a	Q66459699
# b	Q66605860
# b′	Q66689132
# c	Q66605863
# d	Q66605874
# d′	Q66689125
# e	Q66605877
# f	Q66605882
# f′	Q66689116
# f′′	Q66689120

# Adj Stem Classes
# 0 Q67534715
# 1 Q66821144
# 2 Q67534719
# 3 Q67534720
# 4 Q67534722
# 5 Q67534724
# 6 Q67534727

# CREATE
# LAST	Lru	"класс адъективного склонения 1*a по Зализняку"
# LAST	Dru	"класс адъективного склонения 1*a согласно классификации Зализняка"
# LAST	Len	"adj declension class 1*a in Zaliznyak"
# LAST	Den	"adjective declension class 1*a in Zaliznyak classification"
# LAST	P31	Q66821148
# LAST	P407	Q7737
# LAST	P1552	Q66605819
# LAST	P1552	Q66459699
# LAST	P1552	Q66624434
